{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "text_left", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "text_left"}, "inbound_nodes": []}, {"name": "text_right", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "text_right"}, "inbound_nodes": []}, {"name": "embedding", "class_name": "Embedding", "config": {"name": "embedding", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1500, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["text_left", 0, 0, {}]], [["text_right", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding", 0, 0, {}]], [["embedding", 1, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": "_attention", "function_type": "function", "output_shape": "_attention_output_shape", "output_shape_type": "function", "arguments": {}}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["bidirectional_1", 1, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": "_soft_alignment", "function_type": "function", "output_shape": "_soft_alignment_output_shape", "output_shape_type": "function", "arguments": {}}, "inbound_nodes": [[["lambda_1", 0, 0, {}], ["bidirectional_1", 1, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": "_soft_alignment", "function_type": "function", "output_shape": "_soft_alignment_output_shape", "output_shape_type": "function", "arguments": {}}, "inbound_nodes": [[["lambda_1", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQBGQB8AGQCGQAYAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA9W0AAABGOlxvbmVfZHJpdmVcT25lRHJpdmUgLSBtYWlsMi5nZHV0LmVk\ndS5jblwzLjBc6L2v5bel5a+86K66XGhvbWV3b3JrXHJvYm90LW1hc3RlclxlbnRpdHlfbm9ybWFs\naXphdGlvblxlc2ltLnB52gg8bGFtYmRhPnEAAADzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["lambda_2", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA9W0AAABGOlxvbmVfZHJpdmVcT25lRHJpdmUgLSBtYWlsMi5nZHV0LmVk\ndS5jblwzLjBc6L2v5bel5a+86K66XGhvbWV3b3JrXHJvYm90LW1hc3RlclxlbnRpdHlfbm9ybWFs\naXphdGlvblxlc2ltLnB52gg8bGFtYmRhPnQAAADzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["lambda_2", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQBGQB8AGQCGQAYAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA9W0AAABGOlxvbmVfZHJpdmVcT25lRHJpdmUgLSBtYWlsMi5nZHV0LmVk\ndS5jblwzLjBc6L2v5bel5a+86K66XGhvbWV3b3JrXHJvYm90LW1hc3RlclxlbnRpdHlfbm9ybWFs\naXphdGlvblxlc2ltLnB52gg8bGFtYmRhPnIAAADzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["bidirectional_1", 1, 0, {}], ["lambda_3", 0, 0, {}]]]}, {"name": "lambda_7", "class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA9W0AAABGOlxvbmVfZHJpdmVcT25lRHJpdmUgLSBtYWlsMi5nZHV0LmVk\ndS5jblwzLjBc6L2v5bel5a+86K66XGhvbWV3b3JrXHJvYm90LW1hc3RlclxlbnRpdHlfbm9ybWFs\naXphdGlvblxlc2ltLnB52gg8bGFtYmRhPnUAAADzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["bidirectional_1", 1, 0, {}], ["lambda_3", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["lambda_2", 0, 0, {}], ["lambda_4", 0, 0, {}], ["lambda_6", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["bidirectional_1", 1, 0, {}], ["lambda_3", 0, 0, {}], ["lambda_5", 0, 0, {}], ["lambda_7", 0, 0, {}]]]}, {"name": "bidirectional_2", "class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "bidirectional_3", "class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "global_average_pooling1d_1", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"name": "global_max_pooling1d_1", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"name": "global_average_pooling1d_2", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]]}, {"name": "global_max_pooling1d_2", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["global_average_pooling1d_1", 0, 0, {}], ["global_max_pooling1d_1", 0, 0, {}], ["global_average_pooling1d_2", 0, 0, {}], ["global_max_pooling1d_2", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}], "input_layers": [["text_left", 0, 0], ["text_right", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}